---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidSketchError
source: html/f82b1a91-25a7-809d-e698-177f0082547d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidSketchError Property

Sketch is invalid.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidSketchError { get; }
```